app/views/search/index.html.erb

SELECT "doctors".* FROM "doctors" INNER JOIN "clinics_doctors" ON "doctors"."id" = "clinics_doctors"."doctor_id" WHERE "clinics_doctors"."clinic_id" = ?  [["clinic_id", 9]]
---

            <% @clinic.doctors.each do |doctor| %>

SELECT "clinics".* FROM "clinics" INNER JOIN "clinics_doctors" ON "clinics"."id" = "clinics_doctors"."clinic_id" WHERE "clinics_doctors"."doctor_id" = ?  [["doctor_id", 10]]
---
    <thead>
        <% @doctor.clinics.each do |clinic| %>