app/views/doctor_availabilities/_doctor_availability.json.jbuilder

UPDATE "doctor_availabilities" SET "start" = ?, "end" = ?, "updated_at" = ? WHERE "doctor_availabilities"."id" = ?  [["start", "2017-09-06 08:30:00"], ["end", "2017-09-06 10:30:00"], ["updated_at", "2017-09-06 03:51:40.148819"], ["id", 20]]
---

json.update_url doctor_availability_path(@event, method: :patch)