app/controllers/booking_controller.rb

  def create
    @patient = Patient.new(patient_params)
    @patient.save
    @booking = Booking.find(params[:booking_id])
    @booking.patient_id = @patient.id
    @booking.save
---
INSERT INTO "patients" ("name", "mobile", "email", "ssn", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", ""], ["mobile", ""], ["email", ""], ["ssn", ""], ["created_at", "2017-09-06 15:35:21.048359"], ["updated_at", "2017-09-06 15:35:21.048359"]]
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "bookings" SET "patient_id" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["patient_id", 1], ["updated_at", "2017-09-07 02:18:06.353500"], ["id", 2]]