app/controllers/booking_controller.rb

  def create_booking
    @patient = Patient.new(patient_params)
    @patient.save
    @booking = Booking.find(params[:booking_id])
    @booking.patient_id = @patient.id
    @booking.save
---
INSERT INTO "patients" ("name", "mobile", "email", "ssn", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "vamsi"], ["mobile", "987654310"], ["email", "asdfgh@asdfghj.com"], ["ssn", "12345"], ["created_at", "2017-09-07 04:33:41.325494"], ["updated_at", "2017-09-07 04:33:41.325494"]]
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "bookings" SET "patient_id" = ?, "updated_at" = ? WHERE "bookings"."id" = ?  [["patient_id", 22], ["updated_at", "2017-09-07 04:33:41.349053"], ["id", 2]]