app/controllers/doctor_availabilities_controller.rb

  def index
    @events = DoctorAvailability.where(start: params[:start]..params[:end])
---
SELECT "doctor_availabilities".* FROM "doctor_availabilities" WHERE ("doctor_availabilities"."start" BETWEEN ? AND ?)  [["start", "2017-08-27"], ["start", "2017-10-08"]]

  def new
    @event = DoctorAvailability.new
    #@clinics = current_doctor.clinics
    # @clinics = Doctor.joins("inner join clinic_doctors cd on doctors.id = cd.id inner join clinics c on c.id = cd.clinic_id inner join addresses a on a.clinic_id = c.id").
    #   select("c.name ||  ' - ' || a.line1 as full_address").
    #   where("doctors.id = #{current_doctor.id}")
   current_doctor = Doctor.find(params[:current_doctor_id]) if params[:current_doctor_id].present?

    @clinics1 = Clinic.joins(:clinic_doctors).
        select("clinics.id, clinics.name, clinics.address_line1").
        where("clinic_doctors.doctor_id = #{current_doctor.id}")
    @clinics = @clinics1.map {|clinic| [clinic.name.to_s + " - " + clinic.address_line1.to_s, clinic.id] }
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? ORDER BY "doctors"."id" ASC LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT c.name ||  ' - ' || a.line1 as full_address FROM "doctors" inner join clinic_doctors cd on doctors.id = cd.id inner join clinics c on c.id = cd.clinic_id inner join addresses a on a.clinic_id = c.id WHERE (doctors.id = 1)
SELECT clinics.id, clinics.name || clinics.address_line1 as full_address FROM "clinics" INNER JOIN "clinic_doctors" ON "clinic_doctors"."clinic_id" = "clinics"."id" WHERE (clinic_doctors.doctor_id = 1)
SELECT "clinics".* FROM "clinics"

  def create
    @event = DoctorAvailability.new(event_params)
    current_doctor = Doctor.find(params[:current_doctor_id]) if params[:current_doctor_id].present?

    @event.doctor_id = current_doctor.id

    slots = Slot.get_slots(params[:doctor_availability][:start].to_datetime, params[:doctor_availability][:end].to_datetime)
    slots.compact.each do |c|
      Booking.create(clinic_id: params[:doctor_availability][:clinic_id], slot_id: c.id, doctor_id: current_doctor.id, date: params[:doctor_availability][:start].to_date)
---
SELECT  "doctors".* FROM "doctors" WHERE "doctors"."id" = ? ORDER BY "doctors"."id" ASC LIMIT ?  [["id", 9], ["LIMIT", 1]]
SELECT "slots".* FROM "slots"
INSERT INTO "bookings" ("clinic_id", "doctor_id", "slot_id", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["clinic_id", 1], ["doctor_id", 1], ["slot_id", 1], ["date", "2017-09-07"], ["created_at", "2017-09-07 01:25:40.469001"], ["updated_at", "2017-09-07 01:25:40.469001"]]
INSERT INTO "doctor_availabilities" ("doctor_id", "clinic_id", "start", "end", "color", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @clinics = Clinic.all
---
SELECT "clinics".* FROM "clinics"

  def set_event
    @event = DoctorAvailability.find(params[:id])
---
SELECT  "doctor_availabilities".* FROM "doctor_availabilities" WHERE "doctor_availabilities"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]