app/controllers/search_controller.rb

SELECT  "clinics".* FROM "clinics" ORDER BY "clinics"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "doctors".* FROM "doctors" ORDER BY "doctors"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def index
        @clinic = Clinic.first
        @doctor = Doctor.first